#include <iostream>

// Эта функция умеет записывать значение по указателю, переданному в качестве аргумента
void test(int *a) {
    (*a) = 456; // Обращаемся к области памяти по указателю *a и записываем туда значение 456
}

int main(int argc, char **argv)
{
    int b = 123; // Просто объявляем целочисленную переменную и присваиваем ей значение 123

    std::cout << b << std::endl; // Выводим значение переменной b в консоль (выведется 123)

    test(&b); // Передаём функции УКАЗАТЕЛЬ на переменную b
    
    // Функция test() изменила значение переменной b на 456
    
    std::cout << b << std::endl; // Снова выводим значение переменной b (выведется 456)
	
    return 0;
}
